{
  "content": [
    {
      "Q": "I’m thinking about buying my first home. Where do I start?",
      "A": "If you’re thinking buying your first home, you’ll want to start with a bit of independent research! Information is power; an informed buyer, regardless of if you’re working with an agent or not, will typically always make better, higher quality decisions. You’re going to want to start by looking at the general activity in your immediate housing market as well as begin asking yourself the questions crucial to your upcoming decision. Consider factors such as pricing, home necessities, scalability, accessibility to transit, work, school, and other personal influences.  Once you have a general idea of what is happening in your market and what you need out of your property, then you will want to consider reaching out and sitting down with an industry professional to further discuss your personal situation. As well as begin the process of getting preapproved for a mortgage. Your responsibility to yourself for when you begin looking towards purchasing your first home is to ensure you are an informed buyer as well as identified the essentials you need from your property to ultimately make a decision you are both confident & excited in!"
    },
    {
      "Q": "What is a mortgage, how do I get preapproved, what do I need?",
      "A": "A mortgage is a type of loan to finance a property. Majority of people, especially in our markets of the Fraser Valley & Greater Vancouver often don’t have enough liquid capital to purchase a home in total. A mortgage serves as a secure loan, typically from a type-A lender (banks, credit unions), used to finance a home over an extended period (15-30+ years). Getting a preapproval done will allow to know how much your lender will let you borrow and if there were any requirements that would need to be met on the property to receive the loan. For example, if you are preapproved for a $1,500,000 loan on a detached property, the bank or lender may require you to purchase a home with a basement suite for rental income that would be used to help pay off the mortgage to receive the loan. Lenders will often require you to provide information such as proof of citizenship/Canadian Residency, proof of income (usually minimum 12 months), any existing loans, credit checks and so on to determine how much you may qualify for. Regardless, you will want to consult a professional mortgage broker for the most up to date, accurate information regarding all things mortgage.  Having a preapproval done before you consider making offers also significantly raises your buying power in the market as you will have the availability to write offers with fewer or no subjects. Having all your ducks in a row before you go home hunting allows you to immediately capitalize on opportunities with sellers as they arrive by being proactive in negotiations rather than reactive."
    },
    {
      "Q": "Why should I use a Real Estate Agent? Can’t I do it on my own?",
      "A": "It is quite uncommon that you see individuals actively looking to buy or sell in the market without the guidance of a professional agent. An individual is still able to do real estate transactions without an agent, but it is not recommended for a few reasons. A good Realtor® understands BC real estate laws and any enforced rules that you are responsible to abide by when buying or selling your home. Your real estate professional will ensure that you avoid any legal complications that could potentially have a detrimental and lasting financial impact for you and your family. A good agent also often has in-depth information regarding the area they practice in. This could include connections to homes not listed on the MLS which you would not have vision on. Or up to date knowledge on upcoming developments, rezonings, improvement plans and other intricate details regarding a particular community. All which may contain details you may not be aware of that will be imperative to your home buying decisions.  Your Realtor® works for you in your best interest. They will do their best to get you the most advantageous positioning within deals as well as provide several other resources to make the journey of buying or selling your home as straightforward & seamless as possible."
    },
    {
      "Q": "Is there a best time of year price-wise to buy or sell a home?",
      "A": "Market trends, especially those correlated to price are almost always tied to supply and demand. And although external economic & financial factors can play a large role in what may happen in the short/medium term of market outlook, there are almost always going to be other market trends you’ll be able to predict based on historic patterns. For example, we often see the highest volume and interest in the detached house market take place in the summer when kids are out of school and families have more flexibility to make big changes. We also see things slow down toward the holiday and winter seasons where availability & general productivity begin to decline before ramping back up into the spring months.You can never be 100% certain when trying to time any market. But you can make predictions, estimations and assumptions based on historical trends and patterns to try to get the most value from your home or dollar. Working with an experienced professional who understands both your personal situation and the active market will be vital to maximizing your buying power or return on capital. "
    },
    {
      "Q": "How much will I need for closing costs?",
      "A": "Closing Costs are situational depending on the home you’re purchasing. When working with any good & capable Realtor®, after discussing your personal situation and goals, they should be to give you an estimate on how much the entire home buying/selling process will be. It is important for any prospective buyer or seller to understand the entire cost of a real estate transaction in British Columbia immediately from the get-go. This best done at your initial sit down with your Realtor® and is essential to discus to ensure there are no surprises last minute which may effect your deal from completing."
    },
    {
      "Q": "What is an Agent’s Commission fee? How do you get paid?",
      "A": "Agent commission is commonly paid by the seller of their property. Seller traditionally pays for both buyer and seller by commissioning a percentage of the home’s final sale price to both parties. As Real Estate Agents often operate their business under different models, commission splits or even flat-fee commissions may vary from agent to agent. In any transaction that you do in British Columbia, by law, your agent, shortly after acceptance of an offer will always disclose what they are being paid from a deal. If you are the seller of a property, the agent must discuss and write the agreed commission payable when filling out a listing agreement before handing it over for signing."
    }
  ]
}
