[
  {
    "title": "Proactive Monitoring",
    "desc": "After our initial sit down, when you’re ready to enter the market, we will take all the information initially discussed and put it to work. Gurj will set up a system for you that will make life simple and easy by having a search engine proactively pull listings and homes for you to review. With your feedback of what you like or did not like, the engine will narrow it’s search until we are consistently landing on homes that are serious contenders for us to move forward on. Using information as a tool will allow us to find and close on your dream home a quick as possible.",
    "alt": "hands on a blueprint",
    "img": "../images/buyers/phasetwo_1.png",
    "extension": "png"
  },
  {
    "title": "Home Tours & Explorations",
    "desc": "Find a home that meets your use case and passes the eye test is only part one of the equation. The next step will always be to get in the home and objectively look at and evaluate the property in person. Gurj will be there to show you what to look for in the home, what small details we should keep an eye out for, and what clues we can pick up on that will give us a deeper insight of the property.",
    "alt": "a couple with the realtor",
    "img": "../images/buyers/phasetwo_2.png",
    "extension": "png"
  },
  {
    "title": "Market Analysis",
    "desc": "We always do our homework so we can always make the smart decision. Regardless of your budget or personal situation, for any homes you seriously consider, we will prepare a full evaluation of the property, look at the long & short term plans of the associated community & then plan and discuss pricing strategy to close in on your dream home.",
    "alt": "a couple with the realtor reading a guide",
    "img": "../images/buyers/phasetwo_3.png",
    "extension": "png"
  },
  {
    "title": "The Paperwork",
    "desc": "After strategizing and planning the home we want to close in on, Gurj will carefully review and present our offer while having an open channel of communication available to further negotiate the terms of the contract to best position your interest as a buyer while ensuring we don’t run into any untimely surprises.",
    "alt": "a couple with the realtor reading a contract",
    "img": "../images/buyers/phasetwo_4.png",
    "extension": "png"
  },
  {
    "title": "Get the Champagne Ready",
    "desc": "After our offer comes back to us accepted, Gurj will handle the rest of the organization that needs to be done for us to hand you over the keys. From time of acceptance to possession, a few tasks will need to be completed between the brokerage and related parties that Gurj will stay on top of and provide you daily updates on. For you, all that needs to be done is to relax and unwind; the tough part is over.",
    "alt": "hands cheering",
    "img": "../images/buyers/phasetwo_5.png",
    "extension": "png"
  }
]
