[
  {
    "title": "Onboarding Consultation & Sales Strategy",
    "desc": "When you’re ready to sit down and discuss the elements that go into getting you the most out of your home, Gurjivan will take time to go through all your personal needs and expectations to best address real estate goals. Apart of this process is discussing logistics regarding selling your existing home. This includes doing a full assessment of your property and then creating a pricing plan aimed to create optimal competition and interest in your home.",
    "alt": "people consulting",
    "img": "../images/sellers/process_1.png",
    "extension": "png"
  },
  {
    "title": "Home Staging & Décor",
    "desc": "After we plan the fine details of getting your home ready for the market, the next steps is to put the gears in motion. The immediate next step would be to do any necessary improvements that would allow us to show and capture the home as best as it can. This may include bringing in a professional designer to rework the space as optimally as possible to best show the quality of your home, the potential of the space and create a sense of awe that buyers will fall in love with!",
    "alt": "woman watering flowers",
    "img": "../images/sellers/process_2.png",
    "extension": "png"
  },
  {
    "title": "Exterior Improvement",
    "desc": "In addition to the interior, we will plan to have the exterior of the home in tip-top shape to attract as much excitement as possible from prospective buyers. A home owner with a well looked after lawn, exterior walls, home entry amongst other things indicates a true sense of care for their home and that it’s been well taken care of. To wow all of our prospective buyers, we need to make sure their first impression of the home – the exterior, is a masterful one.",
    "alt": "construction worker",
    "img": "../images/sellers/process_3.png",
    "extension": "png"
  },
  {
    "title": "Photography and Videography",
    "desc": "After we having your home looking better than the ones we see in design catalogues; the next step is to bring in our professional photographers who will further highlight and capture your home at it’s best. Our professional partners will work magic when working with lighting, angles which will for certain boost the appeal and desire of your home.",
    "alt": "camera",
    "img": "../images/sellers/process_4.png",
    "extension": "png"
  },
  {
    "title": "Marketing Strategy",
    "desc": "After your home has been highlighted and shown to its fullest potential, we then need to execute our marketing plan to get it in front of as many people as we can. Besides the traditional marketing materials (feature sheets, postings, etc.) we will get word of your listing out by utilizing social media, realtor meetings and pages, online classifieds, media outlets, and more to drive as much interest as we can to your home.",
    "alt": "marketing",
    "img": "../images/sellers/process_5.png",
    "extension": "png"
  },
  {
    "title": "Paperwork",
    "desc": "All the hard work going into showcasing your home is always going to be worth it when it comes to reviewing the formal paperwork and offers that come in post showings. With Gurj, you’ll have a seasoned, experienced professional each step of the way with you to help you go through every offer, identify the strengths and weaknesses in any formal writing and to make it make sense for you and your personal situation.",
    "alt": "checklist",
    "img": "../images/sellers/process_7.png",
    "extension": "png"
  },
  {
    "title": "The Final Wrap Up",
    "desc": "Once all the formal paperwork, offers & any other contracts have been handled, Gurj will help you cross that finish line. Gurjivan knows the deal doesn’t stop at 'sold', so expect first-class service all the way through to make certain everything goes as smooth as possible. Facilitating everything from movers to cleaners, Gurj can supply any resources needed to ensure the well-being of your family during all stages of the sale.",
    "alt": "construction worker",
    "img": "../images/sellers/process_6.png",
    "extension": "png"
  },
  {
    "title": "Additional Post Sale Services",
    "desc": "After accepting the best offer for you, we can begin celebrating our success! When we get confirmation that your your home is sold, Gurj will assist with additional tools and benefits to make post-sale transition seamless as possible. Some benefits include but are not limited to, a full move-out checklist, professional cleaning services ensuring the new owners come to a beautiful & clean home, and a thorough follow up to ensure you and yours are satisfied of the sale of the property and are moving forward with your next chapter.",
    "alt": "manager",
    "img": "../images/sellers/process_8.png",
    "extension": "png"
  }
]
